samples/soap/phpsoap/res.html

<html>
	<head>
		<title>Test SOAP-Interface</title>
	</head>
	<body>
		<h1>Test SOAP-interface of OTRS</h1>
Request :<br> <pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:ns1=&quot;http://www.otrs.org/TicketConnector/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:ns2=&quot;http://xml.apache.org/xml-soap&quot; xmlns:SOAP-ENC=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot; SOAP-ENV:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot;&gt;&lt;SOAP-ENV:Body&gt;&lt;ns1:TicketCreate&gt;&lt;ns1:UserLogin xsi:type=&quot;xsd:string&quot;&gt;fabio.fazio&lt;/ns1:UserLogin&gt;&lt;ns1:Password xsi:type=&quot;xsd:string&quot;&gt;aaAA11!!&lt;/ns1:Password&gt;&lt;Ticket xsi:type=&quot;ns2:Map&quot;&gt;&lt;item&gt;&lt;key xsi:type=&quot;xsd:string&quot;&gt;Title&lt;/key&gt;&lt;value xsi:type=&quot;xsd:string&quot;&gt;some title&lt;/value&gt;&lt;/item&gt;&lt;item&gt;&lt;key xsi:type=&quot;xsd:string&quot;&gt;CustomerUser&lt;/key&gt;&lt;value xsi:type=&quot;xsd:string&quot;&gt;fmfazio@gmail.com&lt;/value&gt;&lt;/item&gt;&lt;item&gt;&lt;key xsi:type=&quot;xsd:string&quot;&gt;Queue&lt;/key&gt;&lt;value xsi:type=&quot;xsd:string&quot;&gt;ZTAC Incoming Queue&lt;/value&gt;&lt;/item&gt;&lt;item&gt;&lt;key xsi:type=&quot;xsd:string&quot;&gt;Type&lt;/key&gt;&lt;value xsi:type=&quot;xsd:string&quot;&gt;default&lt;/value&gt;&lt;/item&gt;&lt;item&gt;&lt;key xsi:type=&quot;xsd:string&quot;&gt;State&lt;/key&gt;&lt;value xsi:type=&quot;xsd:string&quot;&gt;new&lt;/value&gt;&lt;/item&gt;&lt;item&gt;&lt;key xsi:type=&quot;xsd:string&quot;&gt;Priority&lt;/key&gt;&lt;value xsi:type=&quot;xsd:string&quot;&gt;1 very low&lt;/value&gt;&lt;/item&gt;&lt;/Ticket&gt;&lt;Article xsi:type=&quot;ns2:Map&quot;&gt;&lt;item&gt;&lt;key xsi:type=&quot;xsd:string&quot;&gt;Subject&lt;/key&gt;&lt;value xsi:type=&quot;xsd:string&quot;&gt;some subject&lt;/value&gt;&lt;/item&gt;&lt;item&gt;&lt;key xsi:type=&quot;xsd:string&quot;&gt;Body&lt;/key&gt;&lt;value xsi:type=&quot;xsd:string&quot;&gt;some body&lt;/value&gt;&lt;/item&gt;&lt;item&gt;&lt;key xsi:type=&quot;xsd:string&quot;&gt;ContentType&lt;/key&gt;&lt;value xsi:type=&quot;xsd:string&quot;&gt;text/plain; charset=utf8&lt;/value&gt;&lt;/item&gt;&lt;/Article&gt;&lt;/ns1:TicketCreate&gt;&lt;/SOAP-ENV:Body&gt;&lt;/SOAP-ENV:Envelope&gt;

</pre>Response:<br> <pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soap:Envelope soap:encodingStyle=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot; xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:soapenc=&quot;http://schemas.xmlsoap.org/soap/encoding/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;&lt;soap:Body&gt;&lt;TicketCreateResponse xmlns=&quot;http://www.otrs.org/TicketConnector/&quot;&gt;&lt;ArticleID&gt;1618&lt;/ArticleID&gt;&lt;TicketID&gt;735&lt;/TicketID&gt;&lt;TicketNumber&gt;2014111740000052&lt;/TicketNumber&gt;&lt;/TicketCreateResponse&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;
</pre></body>
</html>
